Repository: shiltian/fuelio-ios
Catalog: PumpTally/Localizable.xcstrings
Source language: en
Languages: es, zh_hans

source: ... and %lld more rows
es: ... y %lld filas más
zh_hans: ...还有%lld行

source: %@ Driven
es: %@ Recorridos
zh_hans: 行驶%@

source: %@ This Trip
es: %@ Este Viaje
zh_hans: 本次行程%@

source: %lld record(s) imported successfully
es: %lld registro(s) importado(s) correctamente
zh_hans: 成功导入%lld条记录

source: %lld records
es: %lld registros
zh_hans: %lld条记录

source: %lld records found
es: %lld registros encontrados
zh_hans: 找到%lld条记录

source: Actions
es: Acciones
zh_hans: 操作

source: Add Fueling
es: Agregar Carga
zh_hans: 添加加油记录

source: Add notes (optional)
es: Agregar notas (opcional)
zh_hans: 添加备注（可选）

source: Add Vehicle
es: Agregar Vehículo
zh_hans: 添加车辆

source: Add Your First Vehicle
es: Agrega Tu Primer Vehículo
zh_hans: 添加您的第一辆车

source: All data has been successfully deleted.
es: Todos los datos se han eliminado correctamente.
zh_hans: 所有数据已成功删除。

source: All fueling records have been deleted.
es: Todos los registros de combustible han sido eliminados.
zh_hans: 所有加油记录已删除。

source: An unknown error occurred
es: Ocurrió un error desconocido
zh_hans: 发生未知错误

source: App Information
es: Información de la App
zh_hans: 应用信息

source: Are you sure you want to delete this fueling record? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar este registro de combustible? Esta acción no se puede deshacer.
zh_hans: 确定要删除此加油记录吗？此操作无法撤消。

source: Are you sure you want to delete this vehicle and all its fueling records? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar este vehículo y todos sus registros de combustible? Esta acción no se puede deshacer.
zh_hans: 确定要删除此车辆及其所有加油记录吗？此操作无法撤消。

source: Are You Sure?
es: ¿Estás seguro?
zh_hans: 确定吗？

source: Average
es: Promedio
zh_hans: 平均值

source: Avg %@
es: Prom. %@
zh_hans: 平均%@

source: Avg $/km
es: Prom. $/km
zh_hans: 平均$/km

source: Avg $/Mile
es: Prom. $/Milla
zh_hans: 平均$/英里

source: Avg Fill-up
es: Prom. por Carga
zh_hans: 平均加油费

source: Avg: %@
es: Prom.: %@
zh_hans: 平均：%@

# Avg: %@ %@
source: Avg: %1$@ %2$@
es: Prom.: %1$@ %2$@
zh_hans: 平均：%1$@ %2$@

source: Baseline
es: Base
zh_hans: 基准

source: Build
es: Compilación
zh_hans: 构建号

source: Cancel
es: Cancelar
zh_hans: 取消

source: Changing the unit system will convert all %lld existing record(s) to %@. This cannot be undone.
es: Cambiar el sistema de unidades convertirá todos los %1$lld registro(s) existentes a %2$@. Esto no se puede deshacer.
zh_hans: 更改单位制将把所有%1$lld条现有记录转换为%2$@。此操作无法撤消。

source: Chart Type
es: Tipo de Gráfico
zh_hans: 图表类型

source: Choose File
es: Elegir Archivo
zh_hans: 选择文件

source: Choose which vehicle to import the records to:
es: Elige a qué vehículo importar los registros:
zh_hans: 选择要导入记录的车辆：

source: Clear Fueling History
es: Borrar Historial de Combustible
zh_hans: 清除加油历史

source: Clear Fueling History?
es: ¿Borrar Historial de Combustible?
zh_hans: 清除加油历史？

source: Convert & Save
es: Convertir y Guardar
zh_hans: 转换并保存

source: Convert Records?
es: ¿Convertir Registros?
zh_hans: 转换记录？

source: Cost
es: Costo
zh_hans: 费用

source: Cost per Fill-up
es: Costo por Carga
zh_hans: 每次加油费用

source: Cost per km
es: Costo por km
zh_hans: 每公里费用

source: Cost per Mile
es: Costo por Milla
zh_hans: 每英里费用

source: Counts differ from local data. Use "Force Re-sync from Local" to wipe iCloud and re-upload all local data.
es: Los conteos difieren de los datos locales. Usa "Forzar Re-sincronización desde Local" para borrar iCloud y volver a subir todos los datos locales.
zh_hans: 数量与本地数据不一致。使用「从本地强制重新同步」来清除iCloud并重新上传所有本地数据。

source: CSV file saved successfully.
es: Archivo CSV guardado correctamente.
zh_hans: CSV文件保存成功。

source: Danger Zone
es: Zona de Peligro
zh_hans: 危险操作

source: Dashboard
es: Panel
zh_hans: 仪表盘

source: Data
es: Datos
zh_hans: 数据

source: Data Deleted
es: Datos Eliminados
zh_hans: 数据已删除

source: Data Preview
es: Vista Previa de Datos
zh_hans: 数据预览

source: Date
es: Fecha
zh_hans: 日期

source: Date & Time
es: Fecha y Hora
zh_hans: 日期和时间

source: Date Range
es: Rango de Fechas
zh_hans: 日期范围

source: Delete
es: Eliminar
zh_hans: 删除

source: Delete All Data
es: Eliminar Todos los Datos
zh_hans: 删除所有数据

source: Delete All Data?
es: ¿Eliminar Todos los Datos?
zh_hans: 删除所有数据？

source: Delete Record
es: Eliminar Registro
zh_hans: 删除记录

source: Delete Vehicle
es: Eliminar Vehículo
zh_hans: 删除车辆

source: Didn't fill completely (affects next efficiency calculation)
es: No se llenó completamente (afecta el cálculo de eficiencia siguiente)
zh_hans: 未加满（影响下次效率计算）

source: Disable iCloud Sync?
es: ¿Desactivar Sincronización de iCloud?
zh_hans: 停用iCloud同步？

source: Do you want to keep or remove the local data on this device?
es: ¿Quieres mantener o eliminar los datos locales en este dispositivo?
zh_hans: 您想保留还是删除此设备上的本地数据？

source: Done
es: Listo
zh_hans: 完成

source: Edit
es: Editar
zh_hans: 编辑

source: Edit Record
es: Editar Registro
zh_hans: 编辑记录

source: Efficiency
es: Eficiencia
zh_hans: 效率

source: Enter any 2 fields and the third will be calculated automatically
es: Ingresa 2 campos y el tercero se calculará automáticamente
zh_hans: 输入任意2个字段，第3个将自动计算

source: Error Reading File
es: Error al Leer Archivo
zh_hans: 读取文件错误

source: Estimated %@
es: %@ Estimado
zh_hans: 预估%@

source: Export %lld records as a CSV file
es: Exportar %lld registros como archivo CSV
zh_hans: 将%lld条记录导出为CSV文件

source: Export CSV
es: Exportar CSV
zh_hans: 导出CSV

source: Export Fueling Data
es: Exportar Datos de Combustible
zh_hans: 导出加油数据

source: Export Successful
es: Exportación Exitosa
zh_hans: 导出成功

source: Failed to check iCloud status
es: Error al verificar el estado de iCloud
zh_hans: 检查iCloud状态失败

source: File Information
es: Información del Archivo
zh_hans: 文件信息

source: Fill-up Recorded!
es: ¡Carga Registrada!
zh_hans: 加油已记录！

source: Fill-up Type
es: Tipo de Carga
zh_hans: 加油类型

source: Filled the tank completely
es: Se llenó el tanque completamente
zh_hans: 已加满油箱

source: Force Re-sync from Local
es: Forzar Re-sincronización desde Local
zh_hans: 从本地强制重新同步

source: Force re-sync will delete all iCloud data and re-upload everything from this device.
es: La re-sincronización forzada eliminará todos los datos de iCloud y volverá a subir todo desde este dispositivo.
zh_hans: 强制重新同步将删除所有iCloud数据，并从此设备重新上传所有内容。

source: Force Re-sync?
es: ¿Forzar Re-sincronización?
zh_hans: 强制重新同步？

source: Fuel Details
es: Detalles del Combustible
zh_hans: 燃油详情

source: Fuel Economy
es: Economía de combustible
zh_hans: 燃油经济性

source: Fuel Efficiency
es: Eficiencia de Combustible
zh_hans: 燃油效率

source: Fueling Records
es: Registros de Combustible
zh_hans: 加油记录

source: Full
es: Lleno
zh_hans: 加满

source: Full Tank
es: Tanque Lleno
zh_hans: 加满

source: Gallons
es: Galones
zh_hans: 加仑

source: Give your vehicle a nickname (e.g., "My Tesla", "Family SUV")
es: Dale un apodo a tu vehículo (ej., "Mi Tesla", "SUV Familiar")
zh_hans: 给您的车辆起个昵称（例如，「我的特斯拉」、「家用SUV」）

source: Highest Cost
es: Mayor Costo
zh_hans: 费用最高

source: History
es: Historial
zh_hans: 历史记录

source: History Cleared
es: Historial Borrado
zh_hans: 历史已清除

source: iCloud already contains fueling data. How would you like to handle this?
es: iCloud ya contiene datos de combustible. ¿Cómo deseas manejar esto?
zh_hans: iCloud中已有加油数据。您希望如何处理？

source: iCloud Data
es: Datos de iCloud
zh_hans: iCloud数据

source: iCloud Data Found
es: Datos de iCloud Encontrados
zh_hans: 发现iCloud数据

source: iCloud Error
es: Error de iCloud
zh_hans: iCloud错误

source: iCloud Sync
es: Sincronización de iCloud
zh_hans: iCloud同步

source: iCloud Sync Details
es: Detalles de Sincronización de iCloud
zh_hans: iCloud同步详情

source: iCloud Unavailable
es: iCloud No Disponible
zh_hans: iCloud不可用

source: Import
es: Importar
zh_hans: 导入

source: Import CSV
es: Importar CSV
zh_hans: 导入CSV

source: Import Error
es: Error de Importación
zh_hans: 导入错误

source: Import Fueling Data
es: Importar Datos de Combustible
zh_hans: 导入加油数据

source: Import Successful
es: Importación Exitosa
zh_hans: 导入成功

source: Import Summary
es: Resumen de Importación
zh_hans: 导入摘要

source: Initial Sync Done
es: Sincronización Inicial
zh_hans: 初始同步完成

source: Keep Local Data
es: Mantener Datos Locales
zh_hans: 保留本地数据

source: Kilometers
es: Kilómetros
zh_hans: 公里

source: Kilometers per Liter
es: Kilómetros por litro
zh_hans: 公里/升

source: Kilometers, Liters, km/L
es: Kilómetros, Litros, km/L
zh_hans: 公里、升、km/L

source: Kilometers, Liters, L/100km
es: Kilómetros, Litros, L/100km
zh_hans: 公里、升、L/100km

source: Last Fill-up
es: Última Carga
zh_hans: 上次加油

source: Last fill: %@
es: Última carga: %@
zh_hans: 上次加油：%@

source: Liters
es: Litros
zh_hans: 升

source: Liters per 100 km
es: Litros por 100 km
zh_hans: 升/百公里

source: Loading CSV file...
es: Cargando archivo CSV...
zh_hans: 正在加载CSV文件...

source: Local Data
es: Datos Locales
zh_hans: 本地数据

source: Lowest Cost
es: Menor Costo
zh_hans: 费用最低

source: Make (e.g., Toyota)
es: Marca (ej., Toyota)
zh_hans: 品牌（例如，丰田）

source: Merge Both
es: Combinar Ambos
zh_hans: 合并两者

source: Metric
es: Métrico
zh_hans: 公制

source: Miles
es: Millas
zh_hans: 英里

source: Miles Per Gallon
es: Millas por Galón
zh_hans: 英里/加仑

source: Miles, Gallons, MPG
es: Millas, Galones, MPG
zh_hans: 英里、加仑、MPG

source: Min
es: Mín.
zh_hans: 最小值

source: Missed
es: Perdida
zh_hans: 遗漏

source: Missed Fueling
es: Carga Perdida
zh_hans: 遗漏加油

source: Missed recording previous fill-up(s)
es: No se registraron cargas anteriores
zh_hans: 遗漏了之前的加油记录

source: Model (e.g., Camry)
es: Modelo (ej., Camry)
zh_hans: 型号（例如，凯美瑞）

source: My Vehicles
es: Mis Vehículos
zh_hans: 我的车辆

source: Newest First
es: Más Recientes
zh_hans: 最新优先

source: No file URL provided
es: No se proporcionó URL del archivo
zh_hans: 未提供文件URL

source: No Fueling History
es: Sin Historial de Combustible
zh_hans: 暂无加油历史

source: No fueling records yet
es: Aún no hay registros de combustible
zh_hans: 暂无加油记录

source: No records yet
es: Aún sin registros
zh_hans: 暂无记录

source: No Vehicles Found
es: No Se Encontraron Vehículos
zh_hans: 未找到车辆

source: Not Syncing
es: Sin Sincronizar
zh_hans: 未同步

source: Notes
es: Notas
zh_hans: 备注

source: Odometer
es: Odómetro
zh_hans: 里程表

source: Odometer must be greater than last recorded (%@ %@)
es: El odómetro debe ser mayor que el último registrado (%1$@ %2$@)
zh_hans: 里程表读数必须大于上次记录（%1$@ %2$@）

source: Odometer must be greater than the previous reading (%@ %@).
es: El odómetro debe ser mayor que la lectura anterior (%1$@ %2$@).
zh_hans: 里程表读数必须大于上一条读数（%1$@ %2$@）。

source: Odometer must be greater than zero.
es: La lectura del odómetro debe ser mayor que cero.
zh_hans: 里程表读数必须大于零。

source: Odometer must be less than the next reading (%@ %@).
es: El odómetro debe ser menor que la lectura siguiente (%1$@ %2$@).
zh_hans: 里程表读数必须小于下一条读数（%1$@ %2$@）。

source: Odometer Reading
es: Lectura del Odómetro
zh_hans: 里程表读数

source: Oldest First
es: Más Antiguos
zh_hans: 最早优先

source: Optional Details
es: Detalles Opcionales
zh_hans: 可选详情

source: Partial
es: Parcial
zh_hans: 部分

source: Partial Fill
es: Carga Parcial
zh_hans: 部分加油

source: Partial fill-up
es: Carga parcial
zh_hans: 部分加油

source: Partial fill-up — efficiency may be less accurate
es: Carga parcial — la eficiencia puede ser menos precisa
zh_hans: 部分加油 - 效率可能不够准确

source: Please add a vehicle first before importing records.
es: Por favor, agrega un vehículo antes de importar registros.
zh_hans: 请先添加车辆再导入记录。

source: Please sign in to iCloud in Settings to use this feature.
es: Inicia sesión en iCloud en Configuración para usar esta función.
zh_hans: 请在设置中登录iCloud以使用此功能。

source: Preview
es: Vista Previa
zh_hans: 预览

source: Price
es: Precio
zh_hans: 价格

source: Price per Gallon
es: Precio por Galón
zh_hans: 每加仑价格

source: Price per Liter
es: Precio por Litro
zh_hans: 每升价格

source: Pull failed
es: Error al descargar
zh_hans: 拉取失败

source: Re-sync
es: Re-sincronizar
zh_hans: 重新同步

source: Refresh Counts
es: Actualizar Conteos
zh_hans: 刷新计数

source: Remove Local Data
es: Eliminar Datos Locales
zh_hans: 删除本地数据

source: Required
es: Requerido
zh_hans: 必填

source: Save
es: Guardar
zh_hans: 保存

source: Save to Files
es: Guardar en Archivos
zh_hans: 保存到文件

source: Search records
es: Buscar registros
zh_hans: 搜索记录

source: Select a CSV file to import fueling records
es: Selecciona un archivo CSV para importar registros de combustible
zh_hans: 选择CSV文件以导入加油记录

source: Select Vehicle
es: Seleccionar Vehículo
zh_hans: 选择车辆

source: Settings
es: Configuración
zh_hans: 设置

source: Sort By
es: Ordenar Por
zh_hans: 排序方式

source: Status
es: Estado
zh_hans: 状态

source: Successfully imported %lld records.
es: Se importaron %lld registros correctamente.
zh_hans: 成功导入%lld条记录。

source: Sync Enabled
es: Sincronización Activada
zh_hans: 同步已启用

source: Sync failed
es: Error de sincronización
zh_hans: 同步失败

source: Sync Status
es: Estado de Sincronización
zh_hans: 同步状态

source: Sync your fueling data across all your devices using iCloud.
es: Sincroniza tus datos de combustible en todos tus dispositivos usando iCloud.
zh_hans: 使用iCloud在所有设备间同步加油数据。

source: Synced
es: Sincronizado
zh_hans: 已同步

source: Syncing...
es: Sincronizando...
zh_hans: 同步中...

source: Tap + to add your first fill-up
es: Toca + para agregar tu primera carga
zh_hans: 点击+添加您的第一条加油记录

source: The file doesn't appear to have a valid header row
es: El archivo no parece tener una fila de encabezado válida
zh_hans: 文件似乎没有有效的标题行

source: The file is empty
es: El archivo está vacío
zh_hans: 文件为空

source: The file only contains a header row with no data
es: El archivo solo contiene una fila de encabezado sin datos
zh_hans: 文件仅包含标题行，没有数据

source: The record could not be deleted. No data was changed. Please try again.
es: No se pudo eliminar el registro. No se modificó ningún dato. Inténtalo de nuevo.
zh_hans: 无法删除该记录。未更改任何数据。请重试。

source: This action cannot be undone. All fueling history for this vehicle will be permanently deleted.
es: Esta acción no se puede deshacer. Todo el historial de combustible de este vehículo se eliminará permanentemente.
zh_hans: 此操作无法撤消。该车辆的所有加油历史将被永久删除。

source: This action cannot be undone. All your data will be permanently deleted.
es: Esta acción no se puede deshacer. Todos tus datos se eliminarán permanentemente.
zh_hans: 此操作无法撤消。您的所有数据将被永久删除。

source: This display preference is stored only for this vehicle on this device.
es: Esta preferencia de visualización se guarda solo para este vehículo en este dispositivo.
zh_hans: 此显示偏好仅针对本设备上的这辆车保存。

source: This will convert all %lld record(s) from %@ to %@. This cannot be undone.
es: Esto convertirá todos los %1$lld registro(s) de %2$@ a %3$@. Esto no se puede deshacer.
zh_hans: 这将把所有%1$lld条记录从%2$@转换为%3$@。此操作无法撤消。

source: This will delete all %lld fueling record(s) for this vehicle. The vehicle itself will be kept.
es: Esto eliminará todos los %lld registro(s) de combustible de este vehículo. El vehículo se conservará.
zh_hans: 这将删除该车辆的所有%lld条加油记录。车辆本身将保留。

source: This will delete all data in iCloud and re-upload all local data (%lld vehicle(s), %lld record(s)). This may take a moment.
es: Esto eliminará todos los datos en iCloud y volverá a subir todos los datos locales (%1$lld vehículo(s), %2$lld registro(s)). Esto puede tardar un momento.
zh_hans: 这将删除iCloud中的所有数据，并重新上传所有本地数据（%1$lld辆车，%2$lld条记录）。这可能需要一些时间。

source: This will permanently delete %lld vehicle(s) and %lld fueling record(s).
es: Esto eliminará permanentemente %1$lld vehículo(s) y %2$lld registro(s) de combustible.
zh_hans: 这将永久删除%1$lld辆车和%2$lld条加油记录。

source: This will permanently delete all %lld fueling record(s). The vehicle itself will be kept.
es: Esto eliminará permanentemente todos los %lld registro(s) de combustible. El vehículo se conservará.
zh_hans: 这将永久删除所有%lld条加油记录。车辆本身将保留。

source: This will permanently delete all vehicles and fueling records. This action cannot be undone.
es: Esto eliminará permanentemente todos los vehículos y registros de combustible. Esta acción no se puede deshacer.
zh_hans: 这将永久删除所有车辆和加油记录。此操作无法撤消。

source: Total %@
es: %@ Totales
zh_hans: 总%@

source: Total Cost
es: Costo Total
zh_hans: 总费用

source: Total Fuel
es: Total de Combustible
zh_hans: 总燃油量

source: Total Records
es: Total de Registros
zh_hans: 总记录数

source: Total Spent
es: Gasto Total
zh_hans: 总花费

source: Track your fuel consumption, costs, and efficiency.
es: Registra tu consumo de combustible, costos y eficiencia.
zh_hans: 追踪您的油耗、费用和效率。

source: Trends
es: Tendencias
zh_hans: 趋势

source: Unable to access the selected file.
es: No se puede acceder al archivo seleccionado.
zh_hans: 无法访问所选文件。

source: Unable to Delete
es: No se puede eliminar
zh_hans: 无法删除

source: Unable to open the selected file. Please try again.
es: No se puede abrir el archivo seleccionado. Por favor, intenta de nuevo.
zh_hans: 无法打开所选文件。请重试。

source: Unable to re-sync with iCloud. Please check your connection and try again.
es: No se puede re-sincronizar con iCloud. Verifica tu conexión e intenta de nuevo.
zh_hans: 无法与iCloud重新同步。请检查连接并重试。

source: Unable to read the selected file. Please make sure it is a valid CSV file.
es: No se puede leer el archivo seleccionado. Asegúrate de que sea un archivo CSV válido.
zh_hans: 无法读取所选文件。请确保它是有效的CSV文件。

source: Unable to Save
es: No se puede guardar
zh_hans: 无法保存

source: Unable to save the imported records. Please try again.
es: No se pueden guardar los registros importados. Por favor, intenta de nuevo.
zh_hans: 无法保存导入的记录。请重试。

source: Unable to sync with iCloud. Please check your internet connection and iCloud settings, then try again.
es: No se puede sincronizar con iCloud. Verifica tu conexión a internet y la configuración de iCloud, luego intenta de nuevo.
zh_hans: 无法与iCloud同步。请检查网络连接和iCloud设置，然后重试。

source: Unit System
es: Sistema de Unidades
zh_hans: 单位制

source: Units
es: Unidades
zh_hans: 单位

source: Use iCloud Data
es: Usar Datos de iCloud
zh_hans: 使用iCloud数据

source: Use Local Data
es: Usar Datos Locales
zh_hans: 使用本地数据

source: Vehicle Details
es: Detalles del Vehículo
zh_hans: 车辆详情

source: Vehicle Name
es: Nombre del Vehículo
zh_hans: 车辆名称

source: Vehicle Settings
es: Configuración del Vehículo
zh_hans: 车辆设置

source: Vehicles
es: Vehículos
zh_hans: 车辆

source: Version
es: Versión
zh_hans: 版本

source: Welcome to PumpTally
es: Bienvenido a PumpTally
zh_hans: 欢迎使用 PumpTally

source: When
es: Cuándo
zh_hans: 时间

source: Year (e.g., 2023)
es: Año (ej., 2023)
zh_hans: 年份（例如，2023）

source: Yes
es: Sí
zh_hans: 是

source: Yes, Delete All Records
es: Sí, Eliminar Todos los Registros
zh_hans: 是的，删除所有记录

source: Yes, Delete Everything
es: Sí, Eliminar Todo
zh_hans: 是的，删除所有数据

source: Your changes could not be saved. No data was changed. Please try again.
es: No se pudieron guardar tus cambios. No se modificó ningún dato. Inténtalo de nuevo.
zh_hans: 无法保存更改。未更改任何数据。请重试。

source: Your fueling records will appear here
es: Tus registros de combustible aparecerán aquí
zh_hans: 您的加油记录将显示在这里

source: Error
zh_hans: 错误

source: Error: %@
zh_hans: 错误：%@

source: Imperial
zh_hans: 英制

source: No
zh_hans: 否

source: OK
zh_hans: 好

source: Total
zh_hans: 总计
